In [2]:
import pandas as pd

In [3]:
a = [1,7,2]
pd.Series(a)

0    1
1    7
2    2
dtype: int64

In [16]:
import datetime
pd.date_range(start='2021/05/01' ,end='2021/05/12')

DatetimeIndex(['2021-05-01', '2021-05-02', '2021-05-03', '2021-05-04',
               '2021-05-05', '2021-05-06', '2021-05-07', '2021-05-08',
               '2021-05-09', '2021-05-10', '2021-05-11', '2021-05-12'],
              dtype='datetime64[ns]', freq='D')

In [12]:
fruit = {"fruits":["Apple","Orange","Mango"]}
pd.DataFrame(fruit)

   fruits
0   Apple
1  Orange
2   Mango

In [18]:
eatable = {"fruits":["Apple","Orange","Mango"],
         "vegetables":["Onion","Tomato","Carrot"]}
pd.DataFrame(eatable)

   fruits vegetables
0   Apple      Onion
1  Orange     Tomato
2   Mango     Carrot

In [24]:
pd.read_csv('sample.csv')

        class   name
0         mca  kajal
1       civil  josna
2  mechanical  anita

In [35]:
data = {'A': [1, 2, 3, 1, 2],
        'B': [4, 5, 6, 5, 4],
        'C': [7, 8, 9, 9, 7]}
pd.DataFrame(data).sort_values(by=['A', 'B'])

   A  B  C
0  1  4  7
3  1  5  9
4  2  4  7
1  2  5  8
2  3  6  9

In [45]:
data = {'A': [1, 2, 3],
        'B': [4, 5, 6]}
pd.DataFrame(data, index=['X', 'Y', 'Z']).reset_index(drop=True)

   A  B
0  1  4
1  2  5
2  3  6

In [30]:
data = {'A': [1, 2, 3, 4, 5],
        'B': ['X', 'Y', 'Z', 'W', 'Q']}
pd.DataFrame(data).head(2)

   A  B
0  1  X
1  2  Y

In [32]:
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Occupation': ['Engineer', 'Doctor', 'Teacher', 'Doctor'],
        'Salary': [60000, 80000, 50000, 85000]}

pd.DataFrame(data).groupby('Occupation')['Salary'].mean()

Occupation
Doctor      82500
Engineer    60000
Teacher     50000
Name: Salary, dtype: int64

In [38]:
import numpy as np
data = {'A': [1, 2, np.nan, 4, 5],
        'B': [np.nan, 2, 3, 4, np.nan]}

pd.DataFrame(data).fillna(0)

     A    B
0  1.0  0.0
1  2.0  2.0
2  0.0  3.0
3  4.0  4.0
4  5.0  0.0

In [40]:
data = {'cname': ['CompanyA', 'CompanyB', 'CompanyC', 'CompanyD'],
        'profit': [10000, -5000, 7500, 0]}

df = pd.DataFrame(data)

df['profit'] = df['profit'] > 0

print(df)

      cname  profit
0  CompanyA    True
1  CompanyB   False
2  CompanyC    True
3  CompanyD   False

In [42]:
data1 = {'eid': [101, 102, 103, 104],
         'ename': ['Alice', 'Bob', 'Charlie', 'David'],
         'stipend': [5000, 6000, 5500, 7000]}

df1 = pd.DataFrame(data1)
data2 = {'eid': [101, 102, 103, 104],
         'designation': ['Engineer', 'Doctor', 'Teacher', 'Doctor']}

df2 = pd.DataFrame(data2)
result = pd.merge(df1, df2, on='eid')
result = result.rename(columns={'designation': 'position'})
print(result)

   eid    ename  stipend  position
0  101    Alice     5000  Engineer
1  102      Bob     6000    Doctor
2  103  Charlie     5500   Teacher
3  104    David     7000    Doctor